[
  {
       "name": "Background Correction",
       "code": "prp.bgc",
    "methods": [
      {
        "name": "Robust Multi-Array Average",
        "code": "prp.bgc.rma",
        "info": {
          "desc": "These are background adjustment implementations for the rma method Irizarry et al. (2003). They differ only in how they estimate a set of parameters (generally you should use rma in preference to rma2. In both cases PM probe intensities are corrected by using a global model for the distribution of probe intensities. The model is suggested by looking at plots of the empirical distribution of probe intensities. In particular the observed PM probes are modeled as the sum of a normal noise component $N$ (Normal with mean $µ$ and variance $σ^2$) and a exponential signal component $S$ (exponential with mean $α$). To avoid any possibility of negatives, the normal is truncated at zero. Given we have O the observed intensity, this then leads to an adjustment. $$E(s|O = o) = a + b \\\\frac{a}{b}$$"
        }
      },
      {
        "name": "MAS",
        "code": "prp.bgc.mas",
        "info": {
          "desc": "This is an implementation of the background correction method outlined in the StatisticalAlgorithms Description Document Affymetrix (2002). The chip is broken into a gridof 16 rectangular regions. For each region the lowest 2% of probe intensities are used tocompute a background value for that grid. Each probe is then adjusted based upon aweighted average of the backgrounds for each of the regions. The weights are based onthe distances between the location of the probe and the centriods of 16 different regions. Note this method corrects both PM and MM probes."
        }
      }
    ]
  },
  {
       "name": "Normalization",
       "code": "prp.nrm",
    "methods": [
      {
        "name": "Constant",
        "code": "prp.nrm.cst",
        "info": {
          "desc": "A scaling normalization. This means that all the arrays are scaled so that they have thesame mean value. This would be typical of the approach taken by Affymetrix. However,the Affymetrix normalization is usually done after summarization (you can investigateaffy.scalevalue.exprSet if you are interested) and this normalization is carried outbefore summarization"
        }
      },
      {
        "name": "Contrast",
        "code": "prp.nrm.crt",
        "info": {
          "desc": "This method was proposed by ˚Astrand (2003). It is also a variation on the M vsA methodology, but the normalization is done by transforming the data to a set ofcontrasts, then normalizing."
        }
      }
    ]
  },
  {
       "name": "Phenotype Microarray Correction",
       "code": "prp.pmc",
    "methods": [

    ]
  },
  {
       "name": "Summarization",
       "code": "prp.sum",
    "methods": [

    ]
  }
]
